{
"acceleration": "{\"enabled\":false,\"earliest_time\":\"\",\"cron_schedule\":\"*/5 * * * *\",\"max_time\":3600,\"backfill_time\":\"\",\"source_guid\":\"\",\"manual_rebuilds\":false,\"poll_buckets_until_maxtime\":false,\"max_concurrent\":3,\"allow_skew\":\"0\",\"schedule_priority\":\"default\",\"allow_old_summaries\":false,\"hunk.file_format\":\"\",\"hunk.dfs_block_size\":0,\"hunk.compression_codec\":\"\",\"workload_pool\":\"\"}",
"dataset.commands": "[{\"type\":\"initialdata\",\"isComplete\":true,\"selectedMethod\":\"indexes_and_sourcetypes\",\"spl\":\"((index=\\\"eventgen_fw\\\") (sourcetype=\\\"csv\\\")) | fields \\\"_time\\\", \\\"bytes\\\", \\\"date_mday\\\", \\\"date_wday\\\", \\\"dst_ip\\\", \\\"dst_port\\\", \\\"host\\\", \\\"protocol\\\", \\\"src_ip\\\", \\\"src_port\\\", \\\"_raw\\\"\",\"columns\":[{\"name\":\"_time\",\"type\":\"timestamp\",\"id\":\"04865d26-73b8-49a9-a0f6-57f8f67d9922\"},{\"name\":\"bytes\",\"type\":\"number\",\"id\":\"751991bf-0959-46c8-ae6c-3a6fda27041f\"},{\"name\":\"date_mday\",\"type\":\"number\",\"id\":\"ea0d6a3d-004a-4df8-a327-38e8bbbc7448\"},{\"name\":\"date_wday\",\"type\":\"string\",\"id\":\"f25f9bc0-137c-4754-bc4b-126c17e1e2e5\"},{\"name\":\"dst_ip\",\"type\":\"ipv4\",\"id\":\"04be8cd6-3247-4f89-bc95-dc653262f6df\"},{\"name\":\"dst_port\",\"type\":\"number\",\"id\":\"b04bf719-4883-4e07-9bf7-fd5c0066ec65\"},{\"name\":\"host\",\"type\":\"string\",\"id\":\"74115414-c15a-4d80-b2bd-40b86ef87ff4\"},{\"name\":\"protocol\",\"type\":\"string\",\"id\":\"29b042f1-d8f3-4bc9-8952-3b1bfc8d5a30\"},{\"name\":\"src_ip\",\"type\":\"ipv4\",\"id\":\"8704dd39-d1f6-4e25-a1fa-250bf847cafa\"},{\"name\":\"src_port\",\"type\":\"number\",\"id\":\"591d7cac-51be-4544-9e1b-8ad95b0e6d0f\"},{\"name\":\"_raw\",\"type\":\"raw\",\"id\":\"5578c694-694b-4c14-bfd2-b745188bb090\"}],\"requiredColumns\":[],\"editorValues\":[{\"index\":\"eventgen_fw\",\"sourcetypes\":[\"csv\"]}]}]",
"dataset.display.diversity": "latest",
"dataset.display.limiting": "100000",
"dataset.display.mode": "table",
"dataset.display.sample_ratio": "1",
"dataset.fields": "[{\"name\":\"_raw\"},{\"name\":\"_time\"},{\"name\":\"bytes\"},{\"name\":\"date_mday\"},{\"name\":\"date_wday\"},{\"name\":\"dst_ip\"},{\"name\":\"dst_port\"},{\"name\":\"host\"},{\"name\":\"protocol\"},{\"name\":\"src_ip\"},{\"name\":\"src_port\"}]",
"dataset.type": "table",
"description": "{\"modelName\": \"eventgen_fw_dataset\", \"displayName\": \"eventgen_fw_dataset\", \"description\": \"\", \"objectSummary\": {\"Event-Based\": 0, \"Transaction-Based\": 0, \"Search-Based\": 1}, \"objects\": [{\"objectName\": \"RootObject\", \"displayName\": \"eventgen_fw_dataset\", \"parentName\": \"BaseSearch\", \"comment\": \"\", \"fields\": [{\"fieldName\": \"RootObject\", \"owner\": \"RootObject\", \"type\": \"objectCount\", \"fieldSearch\": \"\", \"required\": false, \"multivalue\": false, \"hidden\": false, \"editable\": false, \"displayName\": \"eventgen_fw_dataset\", \"comment\": \"\"}], \"calculations\": [], \"constraints\": [], \"lineage\": \"RootObject\", \"objectSearchNoFields\": \"| search (index=* OR index=_*) ((index=\\\"eventgen_fw\\\") (sourcetype=\\\"csv\\\")) | fields \\\"_time\\\", \\\"bytes\\\", \\\"date_mday\\\", \\\"date_wday\\\", \\\"dst_ip\\\", \\\"dst_port\\\", \\\"host\\\", \\\"protocol\\\", \\\"src_ip\\\", \\\"src_port\\\", \\\"_raw\\\"   | fields \\\"_time\\\" \\\"host\\\" \\\"source\\\" \\\"sourcetype\\\" \\\"bytes\\\" \\\"date_mday\\\" \\\"date_wday\\\" \\\"dst_ip\\\" \\\"dst_port\\\" \\\"protocol\\\" \\\"src_ip\\\" \\\"src_port\\\"\", \"objectSearch\": \"| search (index=* OR index=_*) ((index=\\\"eventgen_fw\\\") (sourcetype=\\\"csv\\\")) | fields \\\"_time\\\", \\\"bytes\\\", \\\"date_mday\\\", \\\"date_wday\\\", \\\"dst_ip\\\", \\\"dst_port\\\", \\\"host\\\", \\\"protocol\\\", \\\"src_ip\\\", \\\"src_port\\\", \\\"_raw\\\"   | rename bytes AS RootObject.bytes date_mday AS RootObject.date_mday date_wday AS RootObject.date_wday dst_ip AS RootObject.dst_ip dst_port AS RootObject.dst_port protocol AS RootObject.protocol src_ip AS RootObject.src_ip src_port AS RootObject.src_port | fields \\\"_time\\\" \\\"host\\\" \\\"source\\\" \\\"sourcetype\\\" \\\"RootObject.bytes\\\" \\\"RootObject.date_mday\\\" \\\"RootObject.date_wday\\\" \\\"RootObject.dst_ip\\\" \\\"RootObject.dst_port\\\" \\\"RootObject.protocol\\\" \\\"RootObject.src_ip\\\" \\\"RootObject.src_port\\\" | fields _time, RootObject.bytes, RootObject.date_mday, RootObject.date_wday, RootObject.dst_ip, RootObject.dst_port, host, RootObject.protocol, RootObject.src_ip, RootObject.src_port, RootObject\", \"autoextractSearch\": \"| search (index=* OR index=_*) ((index=\\\"eventgen_fw\\\") (sourcetype=\\\"csv\\\")) | fields \\\"_time\\\", \\\"bytes\\\", \\\"date_mday\\\", \\\"date_wday\\\", \\\"dst_ip\\\", \\\"dst_port\\\", \\\"host\\\", \\\"protocol\\\", \\\"src_ip\\\", \\\"src_port\\\", \\\"_raw\\\" \", \"previewSearch\": \"| search (index=* OR index=_*) ((index=\\\"eventgen_fw\\\") (sourcetype=\\\"csv\\\")) | fields \\\"_time\\\", \\\"bytes\\\", \\\"date_mday\\\", \\\"date_wday\\\", \\\"dst_ip\\\", \\\"dst_port\\\", \\\"host\\\", \\\"protocol\\\", \\\"src_ip\\\", \\\"src_port\\\", \\\"_raw\\\"   | fields \\\"_time\\\" \\\"host\\\" \\\"source\\\" \\\"sourcetype\\\" \\\"bytes\\\" \\\"date_mday\\\" \\\"date_wday\\\" \\\"dst_ip\\\" \\\"dst_port\\\" \\\"protocol\\\" \\\"src_ip\\\" \\\"src_port\\\"\", \"objectAccelerationSearch\": \"| search (index=* OR index=_*) ((index=\\\"eventgen_fw\\\") (sourcetype=\\\"csv\\\")) | fields \\\"_time\\\", \\\"bytes\\\", \\\"date_mday\\\", \\\"date_wday\\\", \\\"dst_ip\\\", \\\"dst_port\\\", \\\"host\\\", \\\"protocol\\\", \\\"src_ip\\\", \\\"src_port\\\", \\\"_raw\\\"  | eval nodename = \\\"RootObject\\\" | rename bytes AS RootObject.bytes date_mday AS RootObject.date_mday date_wday AS RootObject.date_wday dst_ip AS RootObject.dst_ip dst_port AS RootObject.dst_port protocol AS RootObject.protocol src_ip AS RootObject.src_ip src_port AS RootObject.src_port | fields nodename, _time, host, source, sourcetype, _time, RootObject.bytes, RootObject.date_mday, RootObject.date_wday, RootObject.dst_ip, RootObject.dst_port, host, RootObject.protocol, RootObject.src_ip, RootObject.src_port\", \"indexScopeWarning\": false, \"baseSearch\": \"((index=\\\"eventgen_fw\\\") (sourcetype=\\\"csv\\\")) | fields \\\"_time\\\", \\\"bytes\\\", \\\"date_mday\\\", \\\"date_wday\\\", \\\"dst_ip\\\", \\\"dst_port\\\", \\\"host\\\", \\\"protocol\\\", \\\"src_ip\\\", \\\"src_port\\\", \\\"_raw\\\"\", \"tsidxNamespace\": \"\"}], \"objectNameList\": [\"RootObject\"]}",
"displayName": "eventgen_fw_dataset",
"name": "eventgen_fw_dataset",
"owner": "admin",
"sharing": "user",
"strict_fields": "true"
}
