{
"eai:data": "<dashboard version=\"1.1\">\n  <label>AWS SIEM Usecases</label>\n  <row>\n    <panel>\n      <title>Browser Session Hijacking</title>\n      <table>\n        <search>\n          <query>index=aws eventName = DescribeEventAggregates  \n| bin span=5m _time \n| stats values(userAgent) values(eventName) values(sourceIPAddress) as src_ip  dc(sourceIPAddress) as distinct_ip_count by _time userIdentity.arn \n| where distinct_ip_count &gt; 1</query>\n          <earliest>0</earliest>\n          <sampleRatio>1</sampleRatio>\n        </search>\n        <option name=\"count\">20</option>\n        <option name=\"dataOverlayMode\">none</option>\n        <option name=\"drilldown\">none</option>\n        <option name=\"percentagesRow\">false</option>\n        <option name=\"rowNumbers\">false</option>\n        <option name=\"totalsRow\">false</option>\n        <option name=\"wrap\">true</option>\n      </table>\n    </panel>\n  </row>\n  <row>\n    <panel>\n      <title>AWS Successful Console Authentication From Multiple IPs</title>\n      <table>\n        <search>\n          <query>source=\"cloudtrail.json\" host=\"aws_server\" index=\"aws\" sourcetype=\"_json\" \n| stats values(userAgent) values(eventName) values(sourceIPAddress) dc(sourceIPAddress) AS distinct_ip\n|  where distinct_ip &gt; 1</query>\n          <earliest>0</earliest>\n          <sampleRatio>1</sampleRatio>\n        </search>\n        <option name=\"count\">20</option>\n        <option name=\"dataOverlayMode\">none</option>\n        <option name=\"drilldown\">none</option>\n        <option name=\"percentagesRow\">false</option>\n        <option name=\"rowNumbers\">false</option>\n        <option name=\"totalsRow\">false</option>\n        <option name=\"wrap\">true</option>\n      </table>\n    </panel>\n  </row>\n</dashboard>",
"eai:type": "views",
"name": "aws_siem_usecases",
"owner": "admin",
"sharing": "user"
}
