{
"eai:data": "<dashboard version=\"1.1\">\n  <label>Splunk Use Cases</label>\n  <row>\n    <panel>\n      <title>Windows Audit Log Tampering</title>\n      <table>\n        <search>\n          <query>index=botsv3  (sourcetype=WinEventLog:Security AND (EventCode=1102 OR EventCode=1100)) OR (sourcetype=WinEventLog:Security AND EventCode=104)\n| stats count by _time EventCode Message sourcetype host</query>\n          <earliest>0</earliest>\n          <sampleRatio>1</sampleRatio>\n        </search>\n        <option name=\"count\">20</option>\n        <option name=\"dataOverlayMode\">none</option>\n        <option name=\"drilldown\">none</option>\n        <option name=\"percentagesRow\">false</option>\n        <option name=\"rowNumbers\">false</option>\n        <option name=\"totalsRow\">false</option>\n        <option name=\"wrap\">true</option>\n      </table>\n    </panel>\n  </row>\n</dashboard>",
"eai:type": "views",
"name": "splunk_use_cases",
"owner": "admin",
"sharing": "user"
}
